---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearMod1
source: html/00336445-d34c-ba37-4f10-55fba699f7cd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearMod1 Property

"Shear modulus X"

## Syntax (C#)
```csharp
public static ForgeTypeId PhyMaterialParamShearMod1 { get; }
```